; domain
;Header and description

(define (domain blocks)

    ;remove requirements that are not needed
    (:requirements :typing :negative-preconditions :conditional-effects :disjunctive-preconditions :existential-preconditions)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        location locatable - object
        block agent - locatable
        static dynamic - block
        robot - agent
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (at ?obj - locatable ?loc - location) ; Object ?obj is at location ?loc)
        (on ?block1 - block ?block2 - block)
        (is-ground ?loc - location)
        (at-top ?block - block) ; Block ?block is at the top of its stack
        (gripper-empty)
        (holding ?robot - robot ?block - block) ; Robot ?robot is holding block ?block
        (path-blocked-from-to ?from - location ?to - location) ; Path from ?from to ?to is blocked        
    )

    ; (:functions ;todo: define numeric functions here
    ; )

    ;define actions here
    (:action move
            :parameters (?robot - robot
                         ?from - location
                         ?to - location)

            :precondition (and
                (at ?robot ?from)
                (not (path-blocked-from-to ?from ?to)))

            :effect (and
                (not (at ?robot ?from))
                (at ?robot ?to))
    )

    (:action grasp
        :parameters (?robot - robot
                     ?block - dynamic
                     ?loc - location)

        :precondition (and
                        (at ?robot ?loc)
                        (at ?block ?loc)
                        (gripper-empty)
                        (at-top ?block)
                      )

        :effect (and
                    (not (at ?block ?loc))
                    (holding ?robot ?block)
                    (not (gripper-empty))
                    (forall (?below_block - block)
                        (when (on ?block ?below_block)
                            (at-top ?below_block)
                        )
                    )
                )
    )

    (:action place
        :parameters (?robot - robot
                     ?block - dynamic
                     ?loc - location)

        :precondition (and
                        (at ?robot ?loc)
                        (holding ?robot ?block)
                        (not (gripper-empty))
                        (or
                            (is-ground ?loc)
                            (exists (?below_block - block)
                                (and
                                    (at ?below_block ?loc)
                                    (at-top ?below_block)
                                )
                            )
                        )
                      )

        :effect (and
                    (gripper-empty)
                    (not (holding ?robot ?block))
                    (at ?block ?loc)
                    (forall (?below_block - block)
                        (when (and
                                (at ?below_block ?loc)
                                (at-top ?below_block)
                              )
                            (and
                                (not (at-top ?below_block))
                                (on ?block ?below_block)
                            )
                        )
                    )
                    (at-top ?block)
                )

    )
)

; problem
(define (problem blocks_problem_3)
    (:domain blocks)
    (:objects block_10 block_11 block_2 block_3 block_4 block_5 block_6 block_7 block_8 block_9 - dynamic p1 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p2 p20 p21 p3 p4 p5 p6 p7 p8 p9 - location robot - robot block_1 - static)
    (:init (is-ground p13) (at block_1 p1) (at block_10 p10) (at block_11 p11) (at block_2 p2) (at block_3 p3) (at block_4 p4) (at block_5 p5) (at block_6 p6) (at block_7 p7) (at block_8 p8) (at block_9 p9) (at robot p12) (at-top block_11) (at-top block_5) (at-top block_8) (gripper-empty) (on block_10 block_9) (on block_11 block_10) (on block_2 block_1) (on block_3 block_2) (on block_4 block_3) (on block_5 block_4) (on block_7 block_6) (on block_8 block_7))
    (:goal (and (at block_2 p13) (at block_3 p13) (at block_4 p13) (at block_5 p13) (at block_6 p13) (at block_7 p13) (at block_8 p13) (at block_9 p13) (at block_10 p13) (on block_10 block_9) (on block_9 block_8) (on block_8 block_7) (on block_7 block_6) (on block_6 block_5) (on block_5 block_4) (on block_4 block_3) (on block_3 block_2)))
)

; plan
1. (move robot p12 p10)
   deleted: (at robot p12)
   added: (at robot p10)
   goals met: 6 of 17
2. (move robot p10 p11)
   deleted: (at robot p10)
   added: (at robot p11)
   goals met: 6 of 17
3. (grasp robot block_11 p11)
   deleted: (at block_11 p11) (gripper-empty)
   added: (holding robot block_11) (at-top block_10)
   goals met: 6 of 17
4. (move robot p11 p10)
   deleted: (at robot p11)
   added: (at robot p10)
   goals met: 6 of 17
5. (move robot p10 p13)
   deleted: (at robot p10)
   added: (at robot p13)
   goals met: 6 of 17
6. (place robot block_11 p13)
   deleted: (holding robot block_11)
   added: (gripper-empty) (at block_11 p13)
   goals met: 6 of 17
7. (move robot p13 p10)
   deleted: (at robot p13)
   added: (at robot p10)
   goals met: 6 of 17
8. (grasp robot block_10 p10)
   deleted: (at block_10 p10) (gripper-empty)
   added: (holding robot block_10) (at-top block_9)
   goals met: 6 of 17
9. (move robot p10 p13)
   deleted: (at robot p10)
   added: (at robot p13)
   goals met: 6 of 17
10. (place robot block_10 p13)
   deleted: (holding robot block_10) (at-top block_11)
   added: (gripper-empty) (at block_10 p13) (on block_10 block_11)
   goals met: 7 of 17
11. (move robot p13 p2)
   deleted: (at robot p13)
   added: (at robot p2)
   goals met: 7 of 17
12. (move robot p2 p5)
   deleted: (at robot p2)
   added: (at robot p5)
   goals met: 7 of 17
13. (grasp robot block_5 p5)
   deleted: (at block_5 p5) (gripper-empty)
   added: (holding robot block_5) (at-top block_4)
   goals met: 7 of 17
14. (move robot p5 p13)
   deleted: (at robot p5)
   added: (at robot p13)
   goals met: 7 of 17
15. (place robot block_5 p13)
   deleted: (holding robot block_5) (at-top block_10)
   added: (gripper-empty) (at block_5 p13) (on block_5 block_10)
   goals met: 8 of 17
16. (move robot p13 p2)
   deleted: (at robot p13)
   added: (at robot p2)
   goals met: 8 of 17
17. (move robot p2 p4)
   deleted: (at robot p2)
   added: (at robot p4)
   goals met: 8 of 17
18. (grasp robot block_4 p4)
   deleted: (at block_4 p4) (gripper-empty)
   added: (holding robot block_4) (at-top block_3)
   goals met: 8 of 17
19. (move robot p4 p13)
   deleted: (at robot p4)
   added: (at robot p13)
   goals met: 8 of 17
20. (place robot block_4 p13)
   deleted: (holding robot block_4) (at-top block_5)
   added: (gripper-empty) (at block_4 p13) (on block_4 block_5)
   goals met: 9 of 17
21. (move robot p13 p3)
   deleted: (at robot p13)
   added: (at robot p3)
   goals met: 9 of 17
22. (grasp robot block_3 p3)
   deleted: (at block_3 p3) (gripper-empty)
   added: (holding robot block_3) (at-top block_2)
   goals met: 9 of 17
23. (move robot p3 p13)
   deleted: (at robot p3)
   added: (at robot p13)
   goals met: 9 of 17
24. (place robot block_3 p13)
   deleted: (holding robot block_3) (at-top block_4)
   added: (gripper-empty) (at block_3 p13) (on block_3 block_4)
   goals met: 10 of 17
25. (move robot p13 p2)
   deleted: (at robot p13)
   added: (at robot p2)
   goals met: 10 of 17
26. (grasp robot block_2 p2)
   deleted: (at block_2 p2) (gripper-empty)
   added: (holding robot block_2) (at-top block_1)
   goals met: 10 of 17
27. (move robot p2 p13)
   deleted: (at robot p2)
   added: (at robot p13)
   goals met: 10 of 17
28. (place robot block_2 p13)
   deleted: (holding robot block_2) (at-top block_3)
   added: (gripper-empty) (at block_2 p13) (on block_2 block_3)
   goals met: 11 of 17
29. (move robot p13 p8)
   deleted: (at robot p13)
   added: (at robot p8)
   goals met: 11 of 17
30. (grasp robot block_8 p8)
   deleted: (at block_8 p8) (gripper-empty)
   added: (holding robot block_8) (at-top block_7)
   goals met: 11 of 17
31. (move robot p8 p13)
   deleted: (at robot p8)
   added: (at robot p13)
   goals met: 11 of 17
32. (place robot block_8 p13)
   deleted: (holding robot block_8) (at-top block_2)
   added: (gripper-empty) (at block_8 p13) (on block_8 block_2)
   goals met: 12 of 17
33. (move robot p13 p7)
   deleted: (at robot p13)
   added: (at robot p7)
   goals met: 12 of 17
34. (grasp robot block_7 p7)
   deleted: (at block_7 p7) (gripper-empty)
   added: (holding robot block_7) (at-top block_6)
   goals met: 12 of 17
35. (move robot p7 p13)
   deleted: (at robot p7)
   added: (at robot p13)
   goals met: 12 of 17
36. (place robot block_7 p13)
   deleted: (holding robot block_7) (at-top block_8)
   added: (gripper-empty) (at block_7 p13) (on block_7 block_8)
   goals met: 13 of 17
37. (grasp robot block_7 p13)
   deleted: (at block_7 p13) (gripper-empty)
   added: (holding robot block_7) (at-top block_8)
   goals met: 12 of 17
38. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 12 of 17
39. (place robot block_7 p6)
   deleted: (holding robot block_7) (at-top block_6)
   added: (gripper-empty) (at block_7 p6)
   goals met: 12 of 17
40. (move robot p6 p9)
   deleted: (at robot p6)
   added: (at robot p9)
   goals met: 12 of 17
41. (grasp robot block_9 p9)
   deleted: (at block_9 p9) (gripper-empty)
   added: (holding robot block_9)
   goals met: 12 of 17
42. (move robot p9 p13)
   deleted: (at robot p9)
   added: (at robot p13)
   goals met: 12 of 17
43. (place robot block_9 p13)
   deleted: (holding robot block_9) (at-top block_8)
   added: (gripper-empty) (at block_9 p13) (on block_9 block_8)
   goals met: 14 of 17
44. (grasp robot block_9 p13)
   deleted: (at block_9 p13) (gripper-empty)
   added: (holding robot block_9) (at-top block_8)
   goals met: 13 of 17
45. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
46. (place robot block_9 p6)
   deleted: (holding robot block_9) (at-top block_7)
   added: (gripper-empty) (at block_9 p6) (on block_9 block_7)
   goals met: 13 of 17
47. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
48. (grasp robot block_8 p13)
   deleted: (at block_8 p13) (gripper-empty)
   added: (holding robot block_8) (at-top block_2) (at-top block_7)
   goals met: 12 of 17
49. (place robot block_8 p13)
   deleted: (holding robot block_8) (at-top block_2)
   added: (gripper-empty) (at block_8 p13)
   goals met: 13 of 17
50. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
51. (grasp robot block_7 p6)
   deleted: (at block_7 p6) (gripper-empty)
   added: (holding robot block_7) (at-top block_6)
   goals met: 13 of 17
52. (place robot block_7 p6)
   deleted: (holding robot block_7) (at-top block_6) (at-top block_9)
   added: (gripper-empty) (at block_7 p6) (on block_7 block_9)
   goals met: 13 of 17
53. (grasp robot block_7 p6)
   deleted: (at block_7 p6) (gripper-empty)
   added: (holding robot block_7) (at-top block_6) (at-top block_9)
   goals met: 13 of 17
54. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
55. (place robot block_7 p13)
   deleted: (holding robot block_7) (at-top block_8)
   added: (gripper-empty) (at block_7 p13)
   goals met: 14 of 17
56. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 14 of 17
57. (grasp robot block_6 p6)
   deleted: (at block_6 p6) (gripper-empty)
   added: (holding robot block_6)
   goals met: 14 of 17
58. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 14 of 17
59. (place robot block_6 p13)
   deleted: (holding robot block_6) (at-top block_7)
   added: (gripper-empty) (at block_6 p13) (on block_6 block_7)
   goals met: 15 of 17
60. (grasp robot block_6 p13)
   deleted: (at block_6 p13) (gripper-empty)
   added: (holding robot block_6) (at-top block_7)
   goals met: 14 of 17
61. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 14 of 17
62. (place robot block_6 p6)
   deleted: (holding robot block_6) (at-top block_9)
   added: (gripper-empty) (at block_6 p6) (on block_6 block_9)
   goals met: 14 of 17
63. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 14 of 17
64. (grasp robot block_7 p13)
   deleted: (at block_7 p13) (gripper-empty)
   added: (holding robot block_7) (at-top block_8) (at-top block_9)
   goals met: 13 of 17
65. (place robot block_7 p13)
   deleted: (holding robot block_7) (at-top block_8)
   added: (gripper-empty) (at block_7 p13)
   goals met: 14 of 17
66. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 14 of 17
67. (grasp robot block_9 p6)
   deleted: (at block_9 p6) (gripper-empty)
   added: (holding robot block_9) (at-top block_8)
   goals met: 14 of 17
68. (place robot block_9 p6)
   deleted: (holding robot block_9) (at-top block_6)
   added: (gripper-empty) (at block_9 p6) (on block_9 block_6)
   goals met: 14 of 17
69. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 14 of 17
70. (grasp robot block_8 p13)
   deleted: (at block_8 p13) (gripper-empty)
   added: (holding robot block_8) (at-top block_2)
   goals met: 13 of 17
71. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
72. (place robot block_8 p6)
   deleted: (holding robot block_8) (at-top block_9)
   added: (gripper-empty) (at block_8 p6) (on block_8 block_9)
   goals met: 13 of 17
73. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
74. (grasp robot block_7 p13)
   deleted: (at block_7 p13) (gripper-empty)
   added: (holding robot block_7) (at-top block_6) (at-top block_9)
   goals met: 12 of 17
75. (place robot block_7 p13)
   deleted: (holding robot block_7) (at-top block_2)
   added: (gripper-empty) (at block_7 p13) (on block_7 block_2)
   goals met: 13 of 17
76. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
77. (grasp robot block_9 p6)
   deleted: (at block_9 p6) (gripper-empty)
   added: (holding robot block_9)
   goals met: 13 of 17
78. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
79. (place robot block_9 p13)
   deleted: (holding robot block_9) (at-top block_7)
   added: (gripper-empty) (at block_9 p13)
   goals met: 14 of 17
80. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 14 of 17
81. (grasp robot block_8 p6)
   deleted: (at block_8 p6) (gripper-empty)
   added: (holding robot block_8) (at-top block_2) (at-top block_7)
   goals met: 14 of 17
82. (place robot block_8 p6)
   deleted: (holding robot block_8) (at-top block_6)
   added: (gripper-empty) (at block_8 p6) (on block_8 block_6)
   goals met: 14 of 17
83. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 14 of 17
84. (grasp robot block_2 p13)
   deleted: (at block_2 p13) (gripper-empty)
   added: (holding robot block_2) (at-top block_3)
   goals met: 13 of 17
85. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
86. (place robot block_2 p6)
   deleted: (holding robot block_2) (at-top block_8)
   added: (gripper-empty) (at block_2 p6) (on block_2 block_8)
   goals met: 13 of 17
87. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
88. (grasp robot block_7 p13)
   deleted: (at block_7 p13) (gripper-empty)
   added: (holding robot block_7) (at-top block_6) (at-top block_8)
   goals met: 12 of 17
89. (place robot block_7 p13)
   deleted: (holding robot block_7) (at-top block_3) (at-top block_9)
   added: (gripper-empty) (at block_7 p13) (on block_7 block_3)
   goals met: 13 of 17
90. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
91. (grasp robot block_8 p6)
   deleted: (at block_8 p6) (gripper-empty)
   added: (holding robot block_8) (at-top block_9)
   goals met: 13 of 17
92. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
93. (place robot block_8 p13)
   deleted: (holding robot block_8) (at-top block_7) (at-top block_9)
   added: (gripper-empty) (at block_8 p13)
   goals met: 14 of 17
94. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 14 of 17
95. (grasp robot block_2 p6)
   deleted: (at block_2 p6) (gripper-empty)
   added: (holding robot block_2) (at-top block_3)
   goals met: 14 of 17
96. (place robot block_2 p6)
   deleted: (holding robot block_2) (at-top block_6)
   added: (gripper-empty) (at block_2 p6) (on block_2 block_6)
   goals met: 14 of 17
97. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 14 of 17
98. (grasp robot block_3 p13)
   deleted: (at block_3 p13) (gripper-empty)
   added: (holding robot block_3) (at-top block_4)
   goals met: 13 of 17
99. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
100. (place robot block_3 p6)
   deleted: (holding robot block_3) (at-top block_2)
   added: (gripper-empty) (at block_3 p6)
   goals met: 13 of 17
101. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
102. (grasp robot block_8 p13)
   deleted: (at block_8 p13) (gripper-empty)
   added: (holding robot block_8) (at-top block_2) (at-top block_6) (at-top block_7) (at-top block_9)
   goals met: 12 of 17
103. (place robot block_8 p13)
   deleted: (holding robot block_8) (at-top block_4) (at-top block_7) (at-top block_9)
   added: (gripper-empty) (at block_8 p13) (on block_8 block_4)
   goals met: 13 of 17
104. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
105. (grasp robot block_6 p6)
   deleted: (at block_6 p6) (gripper-empty)
   added: (holding robot block_6) (at-top block_7) (at-top block_9)
   goals met: 13 of 17
106. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
107. (place robot block_6 p13)
   deleted: (holding robot block_6) (at-top block_7) (at-top block_8) (at-top block_9)
   added: (gripper-empty) (at block_6 p13) (on block_6 block_8)
   goals met: 14 of 17
108. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 14 of 17
109. (grasp robot block_3 p6)
   deleted: (at block_3 p6) (gripper-empty)
   added: (holding robot block_3) (at-top block_4)
   goals met: 14 of 17
110. (place robot block_3 p6)
   deleted: (holding robot block_3) (at-top block_2)
   added: (gripper-empty) (at block_3 p6)
   goals met: 14 of 17
111. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 14 of 17
112. (grasp robot block_4 p13)
   deleted: (at block_4 p13) (gripper-empty)
   added: (holding robot block_4) (at-top block_5)
   goals met: 13 of 17
113. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 13 of 17
114. (place robot block_4 p6)
   deleted: (holding robot block_4) (at-top block_3)
   added: (gripper-empty) (at block_4 p6)
   goals met: 13 of 17
115. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 13 of 17
116. (grasp robot block_6 p13)
   deleted: (at block_6 p13) (gripper-empty)
   added: (holding robot block_6) (at-top block_7) (at-top block_8) (at-top block_9)
   goals met: 12 of 17
117. (place robot block_6 p13)
   deleted: (holding robot block_6) (at-top block_5) (at-top block_7) (at-top block_8) (at-top block_9)
   added: (gripper-empty) (at block_6 p13) (on block_6 block_5)
   goals met: 14 of 17
118. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 14 of 17
119. (grasp robot block_4 p6)
   deleted: (at block_4 p6) (gripper-empty)
   added: (holding robot block_4) (at-top block_3) (at-top block_5)
   goals met: 14 of 17
120. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 14 of 17
121. (place robot block_4 p13)
   deleted: (holding robot block_4) (at-top block_5) (at-top block_6)
   added: (gripper-empty) (at block_4 p13) (on block_4 block_6)
   goals met: 15 of 17
122. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 15 of 17
123. (grasp robot block_3 p6)
   deleted: (at block_3 p6) (gripper-empty)
   added: (holding robot block_3) (at-top block_2)
   goals met: 15 of 17
124. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 15 of 17
125. (place robot block_3 p13)
   deleted: (holding robot block_3) (at-top block_4)
   added: (gripper-empty) (at block_3 p13)
   goals met: 16 of 17
126. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 16 of 17
127. (grasp robot block_2 p6)
   deleted: (at block_2 p6) (gripper-empty)
   added: (holding robot block_2) (at-top block_6) (at-top block_8)
   goals met: 16 of 17
128. (move robot p6 p13)
   deleted: (at robot p6)
   added: (at robot p13)
   goals met: 16 of 17
129. (place robot block_2 p13)
   deleted: (holding robot block_2) (at-top block_3) (at-top block_6) (at-top block_8)
   added: (gripper-empty) (at block_2 p13)
   goals met: 17 of 17
